#### GetEnumerator Method

---

|  |
| --- |
| RebarContainer Class   See Also |

Returns an enumerator that iterates through a collection.

**Namespace:**   Autodesk.Revit.DB.Structure
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)

# Syntax

| C# |
| --- |
| ``` public virtual IEnumerator<RebarContainerItem> GetEnumerator() ``` |

| Visual Basic |
| --- |
| ``` Public Overridable Function GetEnumerator As IEnumerator(Of RebarContainerItem) ``` |

| Visual C++ |
| --- |
| ``` public: virtual IEnumerator<RebarContainerItem^>^ GetEnumerator() ``` |

#### Return Value

An IEnumerator object that can be used to iterate through the collection.

#### Implements

 IEnumerable T GetEnumerator

# See Also

RebarContainer Class

Autodesk.Revit.DB.Structure Namespace